ThomasQi3141/doom-on-htn-badge/firmware/doom/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# UART0's pins drive the button shift register, so USB Serial/JTAG is the only
# console this board has.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# Doom recurses through R_RenderBSPNode and the blockmap iterators. 8 KB was
# upstream-for-a-desktop thinking; a deeper BSP path is exactly the kind of
# thing that only blows up "once you get far enough into the level".
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Every byte counts: the heap's largest contiguous block is only 188 KB.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# On the ESP32-C3 instruction and data RAM come out of the same 400 KB, so
# every byte of IRAM handed back to flash is a byte Doom's zone can use.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=n
CONFIG_SPI_MASTER_IN_IRAM=n
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_DEBUG_STUBS_ENABLE=n
CONFIG_ESP_SYSTEM_USE_EH_FRAME=n
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y

# --- Radio: ESP-NOW between badges ---------------------------------------
# Static RX buffers are 1.6 KB each and taken at esp_wifi_init; ESP-NOW
# frames here are under 64 bytes, so the floor of two is plenty. Nothing
# here speaks IP, so no lwIP and no netif, and the driver keeps its config in
# RAM rather than NVS.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=2
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=2
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_CSI_ENABLED=n
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_11KV_SUPPORT=n
CONFIG_ESP_WIFI_MBO_SUPPORT=n
CONFIG_ESP_WIFI_DPP_SUPPORT=n
CONFIG_ESP_WIFI_11R_SUPPORT=n
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
# IRAM and DRAM are the same 400 KB on the C3. The Wi-Fi driver's IRAM
# options buy throughput we do not need with RAM the zone heap does.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=n
# PHY calibration data would need NVS; a full calibration on every boot
# costs milliseconds and keeps the NVS library out of the image.
# (CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=n would drop mbedTLS's 28 KB too, but in
# IDF v5.5.1 the supplicant then fails to link: sha1_vector is undefined.)
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=n
